clear
clc
load wenti1;
k0=0.9996; %UTM投影比例因子
t=1:10001; %仿真时间
B=delta; %纬度alpha=atan(Yo./Xo); %alpha需要矫正？？delta=atan(Zo./(sqrt(Xo.^2+Yo.^2)))
L=alpha; %经度
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
n=fix(L/6+1);
L0=6*n-3; %计算其所在6度带的中央子午线经度L0
T=(tan(b)).^2;c
C=e^2.*(cos(B).^2);
A=(L-L0).*cos(B);
FE=500000; %东纬偏移 FE= 500000m
FN=10000000; %北纬偏移 北半球 FN=0，南半球FN=10000000m；
%--------------------------------------------------------------------------
M=a*((1-e^2/4-3*e^4/64-5*e^6/256).*B...
-(3*e^2/8+3*e^4/32+45*e^6/1024).*sin(2*B)...
+(15*e^4/256+45*e^6/1024).*sin(4*B)...
-(35*e^6/3072).*sin(6*B));
N=a./sqrt(1-e^2*(sin(B)).^2);
Xn=k0*(M+N.*tan(B).*((A.^2)/2+(5-T+9.*C+4.*(C.^2)).*(A.^4)/24)+(61-58*T+(T.^2)+270.*C-330.*T.*C).*(A.^6)/720);
Ye=FE+k0.*N.*(A+(1-T+C).*(A.^3)/6+(5-8.*T+T.^2+14.*C-58.*T.*C).*(A.^5)/120);
if (Xn<0)
Xn=FN+Xn;
end
%--------------------------------------------------------------------------
figure
plot(t,Xn,'r-')
hold on
plot(t,Ye,'g-.')
hold off
legend('X-轴分量','Y- 轴分量')
title('星下点轨迹UTM投影图');
