%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% wenti1.m 任务一：仿真一周期内卫星星下点轨迹图
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
clear
clc
%--------------------------------------------------------------------------
% 仿真参数设置
%--------------------------------------------------------------------------
m=10000.0000002;
Re=6.37814e+6;         %地球半径
Ea= 6378136.49; %地球长半轴
Eb= 6356755.00; %地球短半轴
a=6892136.49; %轨道长半轴
e=0.001; %轨道偏心率
we=7.2921158e-5;       %地球角速度
c=e*a; %卫星的椭圆轨道的焦距
b=sqrt(a.^2-c.^2); %轨道半短轴
i=96*pi/180; %轨道倾角
w=90*pi/180; %近地点幅角
Omega=0*pi/180; %升交点赤经
f0=60*pi/180; %初始时刻真近心角
aten=45*pi/180; %天线视角
G=6.67428*10^(-11); %万有引力常数
M=5.977*10^24; %地球质量
Ts=sqrt(4*pi^2/G/M*a^3); %卫星的周期
n=2*pi/Ts; %卫星的角速度
T=0:10000; %仿真时间，以秒为单位
f=f0+n*T; %真近心角随时间变化
r=a*(1-e^2)./(1+e*cos(f)); %卫星到地心的距离随时间变化
%--------------------------------------------------------------------------
% 轨道计算:轨道直角->地心惯性->星下点
%--------------------------------------------------------------------------
% 在轨道直角坐标系中卫星的位置
%--------------------------------------------------------------------------
Xs=r.*cos(f);   
Ys=r.*sin(f);
Zs=zeros(size(f));
Rz=[Xs;Ys;Zs];
%--------------------------------------------------------------------------
% 在地心惯性坐标系中卫星的位置
%--------------------------------------------------------------------------
Romega=[cos(Omega),-sin(Omega),0;sin(Omega),cos(Omega),0;0,0,1];
Ri=[1,0,0;0,cos(i),-sin(i);0,sin(i),cos(i)];
Rw=[cos(w),-sin(w),0;sin(w),cos(w),0;0,0,1];
Eo=Romega*Ri*Rw*Rz;
%--------------------------------------------------------------------------
% 卫星星下点轨迹的位置
%--------------------------------------------------------------------------
Xo=Eo(1,:);Yo=Eo(2,:);Zo=Eo(3,:);
R=sqrt(Xo.^2+Yo.^2+Zo.^2);%每个点都做均方差
alpha=atan(Yo./Xo); 
delta=atan(Zo./(sqrt(Xo.^2+Yo.^2)));
Rg=[R.*cos(delta).*cos(alpha);
    R.*cos(delta).*sin(alpha);
    R.*sin(delta)];
Hg=we*T;
Eg=[cos(Hg).*Eo(1,:)+sin(Hg).*Eo(2,:);(-1)*sin(Hg).*Eo(1,:)+cos(Hg).*Eo(2,:);Eo(3,:)];
jingdu=atan(Eg(2,:)./Eg(1,:));
jingduad=[ones(1,floor(m/4)-1)*0,ones(1,ceil(m/4))*pi*(-1),ones(1,floor(m/4)-3)*pi*(-1),ones(1,ceil(m/4)+4)*pi*(-2)];
jingdu=jingdu+jingduad(1:10001);% 

%--------------------------------------------------------------------------
figure;
[x1,y1,z1] = sphere;
surf(x1*Re,y1*Re,z1*Re);  
hold on;
plot3(Eg(1,:),Eg(2,:),Eg(3,:),'r', 'LineWidth',2);
view(30,4);
figure;
weidu=asin(Eg(3,:)./sqrt(Eg(1,:).^2+Eg(2,:).^2+Eg(3,:).^2));
plot(jingdu,weidu);
title('卫星星下点轨迹');
xlabel('纬度（rad）');ylabel('经度（rad）');


figure
plot(T,Rg(1,:),'r-')
hold on
plot(T,Rg(2,:),'g-.')
plot(T,Rg(3,:),'b--')
hold off
legend('x轴分量','y轴分量','z轴分量')
title('卫星星下点的轨迹图')
save wenti1; %保存第一问的数据在第二问中继续使用
